Revit 2026 API
FieldDomainPointsByUV Class
 Represents a set of two-dimensional point coordinates (defined usually on surface)
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.FieldDomainPoints
 Autodesk.Revit.DB.Analysis.FieldDomainPointsByUV
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class FieldDomainPointsByUV : FieldDomainPoints
Public Class FieldDomainPointsByUV
	Inherits FieldDomainPoints
public ref class FieldDomainPointsByUV : public FieldDomainPoints
type FieldDomainPointsByUV =
    class
        inherit FieldDomainPoints
    end
The FieldDomainPointsByUV type exposes the following members.
Constructors
Name | Description
FieldDomainPointsByUV(IList<UV>) | Initializes a new instance of the FieldDomainPointsByUV class
FieldDomainPointsByUV(IList<UV>, ICollection<Double>, ICollection<Double>) | Initializes a new instance of the FieldDomainPointsByUV class
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from FieldDomainPoints)
Top
Methods
Name | Description
Dispose
(Inherited from FieldDomainPoints)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetGridCoordinates
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace